Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The ``meta-yocto`` repository is hosted at :yocto_git:`/meta-yocto`.
it_it: Il repository ``meta-yocto`` è ospitato in :yocto_git:`/meta-yocto`.

source: The ``openembedded-core/scripts/contrib/improve_kernel_cve_report.py`` script leverages CVE kernel metadata and the :term:`SPDX_INCLUDE_COMPILED_SOURCES` variable to update an output ``.sbom-cve-check.yocto.json`` report file (see section :ref:`security-manual/vulnerabilities:Vulnerability check at build time` for details on these report files). It reduces CVE false positives by 70%-80% and provide detailed responses for all kernel-related CVEs by analyzing the files used to build the kernel. The script is decoupled from the build and can be run outside of the :term:`BitBake` environment.
it_it: Lo script ``openembedded-core/scripts/contrib/improve_kernel_cve_report.py`` sfrutta i metadati CVE del kernel e la variabile :term:`SPDX_INCLUDE_COMPILED_SOURCES` per aggiornare un file di report di output ``.sbom-cve-check.yocto.json`` (vedere la sezione :ref:`security-manual/vulnerabilities:Vulnerability check at build time` per i dettagli su questi file di report). Riduce i falsi positivi CVE del 70%-80% e fornisce risposte dettagliate per tutte le CVE relative al kernel analizzando i file utilizzati per la compilazione del kernel. Lo script è indipendente dal processo di compilazione e può essere eseguito al di fuori dell'ambiente :term:`BitBake`.

source: The ``perf`` command measures Toaster performance. Access the command as follows:
it_it: Il comando ``perf`` misura le prestazioni di Toaster. È possibile accedervi nel seguente modo:

source: The ``raspberrypi5`` build depends on non-free firmware (https://github.com/RPi-Distro/firmware-nonfree) that includes the `Synaptics` license. See the :yocto_git:`ipcompliance.md </meta-raspberrypi/tree/docs/ipcompliance.md>` document for more information. Add the ``synaptics-killswitch`` value to the :term:`LICENSE_FLAGS_ACCEPTED` variable, in the :ref:`structure-build-conf-local.conf` file of your build directory::
it_it: La build ``raspberrypi5`` dipende da un firmware non libero (https://github.com/RPi-Distro/firmware-nonfree) che include la licenza `Synaptics`. Per ulteriori informazioni, consultare il documento :yocto_git:`ipcompliance.md </meta-raspberrypi/tree/docs/ipcompliance.md>`. Aggiungere il valore ``synaptics-killswitch`` alla variabile :term:`LICENSE_FLAGS_ACCEPTED`, nel file :ref:`structure-build-conf-local.conf` della directory di build::

source: The ``runbuilds`` command checks if scheduled builds exist in the database and then launches them per schedule. The command returns after the builds start but before they complete. The Toaster Logging Interface records and updates the database when the builds complete.
it_it: Il comando ``runbuilds`` verifica se nel database sono presenti build pianificate e, in caso affermativo, le avvia in base alla pianificazione. Il comando restituisce un valore al termine delle build, ma prima del loro completamento. L'interfaccia di registrazione di Toaster registra e aggiorna il database al termine delle build.

source: The ``runbuilds`` command launches scheduled builds. Access the command as follows:
it_it: Il comando ``runbuilds`` avvia le build pianificate. Per accedervi, procedere come segue:

source: The ``scripts`` directory has useful scripts that assist in contributing back to the Yocto Project, such as ``create-pull-request`` and ``send-pull-request``.
it_it: La directory ``scripts`` contiene script utili per contribuire a Yocto Project, come ``create-pull-request`` e ``send-pull-request``.

source: The ``sendemail.from`` should match your ``user.email`` setting, which appears in the ``Signed-off-by`` line of your commits.
it_it: Il campo ``sendemail.from`` deve corrispondere all'impostazione ``user.email``, che appare nella riga ``Signed-off-by`` dei commit.

source: The above listing of ``current_tracer`` shows that the ``nop`` tracer is in effect, which is just another way of saying that there's actually no tracer currently in effect.
it_it: L'elenco di ``current_tracer`` sopra riportato mostra che è attivo il tracer ``nop``, il che significa che al momento non è attivo alcun tracer.

source: The above manual pages, along with manuals for the other blktrace utilities (``btt``, ``blkiomon``, etc) can be found in the ``/doc`` directory of the blktrace tools git repository::
it_it: Le pagine di manuale sopra riportate, insieme ai manuali per le altre utilità di blktrace (``btt``, ``blkiomon``, ecc.) sono disponibili nella directory ``/doc`` del repository Git degli strumenti di blktrace::

source: The above screenshot displays a "flat" profile, one entry for each "bucket" corresponding to the functions that were profiled during the profiling run, ordered from the most popular to the least (perf has options to sort in various orders and keys as well as display entries only above a certain threshold and so on --- see the perf documentation for details). Note that this includes both user space functions (entries containing a ``[.]``) and kernel functions accounted to the process (entries containing a ``[k]``). perf has command-line modifiers that can be used to restrict the profiling to kernel or user space, among others.
it_it: Lo screenshot qui sopra mostra un profilo "piatto", con una voce per ogni "bucket" corrispondente alle funzioni profilate durante l'esecuzione del profilo, ordinate dalla più frequente alla meno frequente (perf offre opzioni per ordinare in vari modi e con diverse chiavi, nonché per visualizzare solo le voci al di sopra di una determinata soglia e così via - consultare la documentazione di perf per maggiori dettagli). Si noti che questo include sia le funzioni dello spazio utente (voci contenenti ``[.]``) sia le funzioni del kernel attribuite al processo (voci contenenti ``[k]``). perf dispone di modificatori da riga di comando che possono essere utilizzati per limitare la profilazione allo spazio kernel o allo spazio utente, tra le altre opzioni.

source: The above screenshot shows the other half of the journey for the data --- from the ``wget`` program's user space buffers to disk. To get the buffers to disk, the wget program issues a ``write(2)``, which does a ``copy-from-user`` to the kernel, which then takes care via some circuitous path (probably also present somewhere in the profile data), to get it safely to disk.
it_it: Lo screenshot sopra mostra l'altra metà del percorso dei dati: dai buffer in spazio utente del programma ``wget`` al disco. Per trasferire i buffer su disco, il programma wget esegue una ``write(2)``, che effettua una ``copy-from-user`` al kernel, il quale poi si occupa, tramite un percorso indiretto (probabilmente presente anche da qualche parte nei dati di profilo), di trasferire i dati in modo sicuro su disco.

source: The above section explained how BitBake skips the execution of tasks whose output can already be found in the Shared State cache.
it_it: La sezione precedente ha spiegato come BitBake salta l'esecuzione dei task il cui output è già presente nella cache dello stato condiviso.

source: The above sets the current tracer to be the ``function`` tracer. This tracer traces every function call in the kernel and makes it available as the contents of the ``trace`` file. Reading the ``trace`` file lists the currently buffered function calls that have been traced by the function tracer::
it_it: Il comando precedente imposta il tracer corrente su ``function``. Questo tracer traccia ogni chiamata di funzione nel kernel e la rende disponibile come contenuto del file ``trace``. La lettura del file ``trace`` elenca le chiamate di funzione attualmente memorizzate nel buffer che sono state tracciate dal tracer di funzione::

source: The above setting will noticeably increase the size of your image.
it_it: L'impostazione sopra descritta aumenterà notevolmente le dimensioni dell'immagine.

source: The administration interface has a "Layer sources" section that includes an "Add layer source" button. Click that button and provide the required information. Make sure you select "layerindex" as the layer source type.
it_it: L'interfaccia di amministrazione presenta una sezione "Layer sources" che include un pulsante "Add layer source". Cliccare su questo pulsante e fornire le informazioni richieste. Assicurarsi di selezionare "layerindex" come tipo di origine layer.

source: The append file needs to be in the ``meta-xyz/recipes-core/init-ifupdown`` directory.
it_it: Il file di append deve trovarsi nella directory ``meta-xyz/recipes-core/init-ifupdown``.

source: The automatically added runtime dependency also includes a version restriction. This version restriction specifies that at least the current version of the package that provides the shared library must be used, as if "package (>= version)" had been added to :term:`RDEPENDS`. This forces an upgrade of the package containing the shared library when installing the package that depends on the library, if needed.
it_it: La dipendenza di runtime aggiunta automaticamente include anche una restrizione di versione. Questa restrizione di versione specifica che deve essere utilizzata almeno la versione corrente del pacchetto che fornisce la libreria shared, come se "package (>= version)" fosse stato aggiunto a :term:`RDEPENDS`. Questo impone l'aggiornamento del pacchetto contenente la libreria shared durante l'installazione del pacchetto che dipende da tale libreria, se necessario.

source: The availability of objects in the sstate cache is handled by the function specified by the :term:`BB_HASHCHECK_FUNCTION` variable and returns a list of available objects. The function specified by the :term:`BB_SETSCENE_DEPVALID` variable is the function that determines whether a given dependency needs to be followed, and whether for any given relationship the function needs to be passed. The function returns a True or False value.
it_it: La disponibilità degli oggetti nella cache sstate è gestita dalla funzione specificata dalla variabile :term:`BB_HASHCHECK_FUNCTION`, che restituisce un elenco degli oggetti disponibili. La funzione specificata dalla variabile :term:`BB_SETSCENE_DEPVALID` determina se una data dipendenza deve essere rispettata e se, per una data relazione, la funzione deve essere passata. La funzione restituisce un valore True o False.

source: The base list of licenses used by the build process is a combination of the Software Package Data Exchange (SPDX) list and the Open Source Initiative (OSI) projects. `SPDX Group <https://spdx.org>`__ is a working group of the Linux Foundation that maintains a specification for a standard format for communicating the components, licenses, and copyrights associated with a software package. `OSI <https://opensource.org>`__ is a corporation dedicated to the Open Source Definition and the effort for reviewing and approving licenses that conform to the Open Source Definition (OSD).
it_it: L'elenco di base delle licenze utilizzate dal processo di compilazione è una combinazione dell'elenco Software Package Data Exchange (SPDX) e dei progetti Open Source Initiative (OSI). `SPDX Group <https://spdx.org>`__ è un gruppo di lavoro della Linux Foundation che si occupa di definire una specifica per un formato standard di comunicazione dei componenti, delle licenze e dei diritti d'autore associati a un pacchetto software. `OSI <https://opensource.org>`__ è un'organizzazione dedicata alla Open Source Definition (OSD) e all'attività di revisione e approvazione delle licenze conformi a tale definizione.

source: The blktrace instance on the host will save the target output inside a ``<hostname>-<timestamp>`` directory::
it_it: L'istanza di blktrace sull'host salverà l'output del target in una directory ``<hostname>-<timestamp>``::

source: The build process supports several types of images to satisfy different needs. See the ":ref:`ref-manual/images:Images`" chapter in the Yocto Project Reference Manual for information on supported images.
it_it: Il processo di build supporta diversi tipi di immagini per soddisfare esigenze differenti. Consultare il capitolo ":ref:`ref-manual/images:Images`" nel Manuale di Riferimento di Yocto Project per informazioni sulle immagini supportate.

source: The build process writes images out to the :term:`Build Directory` inside the ``tmp/deploy/images/machine/`` folder as shown in the figure. This folder contains any files expected to be loaded on the target device. The :term:`DEPLOY_DIR` variable points to the ``deploy`` directory, while the :term:`DEPLOY_DIR_IMAGE` variable points to the appropriate directory containing images for the current configuration.
it_it: Il processo di build scrive le immagini nella :term:`Build Directory` all'interno della cartella ``tmp/deploy/images/machine/``, come mostrato in figura. Questa cartella contiene tutti i file che si prevede vengano caricati sul dispositivo di destinazione. La variabile :term:`DEPLOY_DIR` punta alla directory ``deploy``, mentre la variabile :term:`DEPLOY_DIR_IMAGE` punta alla directory appropriata contenente le immagini per la configurazione corrente.

source: The build processes use the ``*_setscene`` tasks for the task acceleration phase. BitBake goes through this phase before the main execution code and tries to accelerate any tasks for which it can find shared state packages. If a shared state package for a task is available, the shared state package is used. This means the task and any tasks on which it is dependent are not executed.
it_it: I processi di compilazione utilizzano i task ``*_setscene`` per la fase di accelerazione dei task. BitBake esegue questa fase prima del codice di esecuzione principale e tenta di accelerare tutte i task per i quali riesce a trovare pacchetti di stato condiviso. Se è disponibile un pacchetto di stato condiviso per un task, questo viene utilizzato. Ciò significa che il task e tutti i task da cui dipende non vengono eseguiti.

source: The build system does not maintain :term:`PR` information as part of the shared state packages. Consequently, there are considerations that affect maintaining shared state feeds. For information on how the build system works with packages and can track incrementing :term:`PR` information, see the ":ref:`dev-manual/packages:automatically incrementing a package version number`" section in the Yocto Project Development Tasks Manual.
it_it: Il sistema di build non gestisce le informazioni :term:`PR` come parte dei pacchetti di shared state. Di conseguenza, vi sono considerazioni che influiscono sulla gestione dei feed di shared state. Per informazioni su come il sistema di build gestisce i pacchetti e come può tenere traccia dell'incremento delle informazioni :term:`PR`, consultare la sezione ":ref:`dev-manual/packages:automatically incrementing a package version number`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: The build system dynamically creates :ref:`do_image_* <ref-tasks-image>` tasks as needed, based on the image types specified in the :term:`IMAGE_FSTYPES` variable. The process turns everything into an image file or a set of image files and can compress the root filesystem image to reduce the overall size of the image. The formats used for the root filesystem depend on the :term:`IMAGE_FSTYPES` variable. Compression depends on whether the formats support compression.
it_it: Il sistema di build crea dinamicamente task :ref:`do_image_* <ref-tasks-image>` secondo necessità, in base ai tipi di immagine specificati nella variabile :term:`IMAGE_FSTYPES`. Il processo trasforma tutto in un file immagine o in un insieme di file immagine e può comprimere l'immagine del filesystem di root per ridurne le dimensioni complessive. I formati utilizzati per il filesystem di root dipendono dalla variabile :term:`IMAGE_FSTYPES`. La compressione dipende dal fatto che i formati supportino o meno la compressione.

source: The build system fetches and downloads the source code from the specified location. The build system supports standard methods such as tarballs or source code repositories systems such as Git.
it_it: Il sistema di build recupera e scarica il codice sorgente dalla posizione specificata. Il sistema di build supporta metodi standard come i tarball o i sistemi di repository di codice sorgente come Git.

source: The build system generates the file system image and a customized :doc:`SDK </sdk-manual/index>` (Software Development Kit) for application development in parallel.
it_it: Il sistema di build genera l'immagine del file system e un :doc:`SDK </sdk-manual/index>` (Software Development Kit) personalizzato per lo sviluppo parallelo delle applicazioni.

source: The build system has knowledge of the relationship between these tasks and other preceding tasks. For example, if BitBake runs ``do_populate_sysroot_setscene`` for something, it does not make sense to run any of the :ref:`ref-tasks-fetch`, :ref:`ref-tasks-unpack`, :ref:`ref-tasks-patch`, :ref:`ref-tasks-configure`, :ref:`ref-tasks-compile`, and :ref:`ref-tasks-install` tasks. However, if :ref:`ref-tasks-package` needs to be run, BitBake needs to run those other tasks.
it_it: Il sistema di build conosce la relazione tra questi task e gli altri task precedenti. Ad esempio, se BitBake esegue ``do_populate_sysroot_setscene`` per un determinato scopo, non ha senso eseguire nessuna dei task :ref:`ref-tasks-fetch`, :ref:`ref-tasks-unpack`, :ref:`ref-tasks-patch`, :ref:`ref-tasks-configure`, :ref:`ref-tasks-compile` e :ref:`ref-tasks-install` tasks. Tuttavia, se è necessario eseguire :ref:`ref-tasks-package`, BitBake deve eseguire anche questi altri task.

source: The build system needs to be configured to sign new shared state artifacts when they are generated. The generation of new artifacts is done once a task has finished being executed.
it_it: Il sistema di build deve essere configurato per firmare i nuovi artefatti di shared state quando vengono generati. La generazione di nuovi artefatti avviene al termine dell'esecuzione di un task.

source: The build system then installs the software into a temporary staging area where the binary package format you select (DEB, RPM, or IPK) is used to roll up the software.
it_it: Il sistema di build installa quindi il software in un'area di staging temporanea dove viene utilizzato il formato del pacchetto binario selezionato (DEB, RPM o IPK) per creare il pacchetto del software.

source: The build system used by the Yocto Project, using :term:`Bitbake` as the task executor. Throughout the Yocto Project documentation, the OpenEmbedded build system is sometimes referred to simply as "the build system". If other build systems, such as a host or target build system are referenced, the documentation clearly states the difference.
it_it: Il sistema di build utilizzato da Yocto Project, che impiega :term:`Bitbake` come esecutore di task. Nella documentazione di Yocto Project, il sistema di build OpenEmbedded viene talvolta indicato semplicemente come "il sistema di build". Qualora vengano menzionati altri sistemi di build, come ad esempio un sistema di build host o target, la documentazione ne specifica chiaramente la differenza.

source: The builds assume :term:`DL_DIR` is a safe location. Once download artefacts enter that location they are not repeatedly re-verified. A user could edit the git trees or tarballs there in ways the build might not detect.
it_it: Le build presuppongono che :term:`DL_DIR` sia una posizione sicura. Una volta che gli artefatti scaricati entrano in tale posizione, non vengono ri-verificati ripetutamente. Un utente potrebbe modificare gli alberi Git o i file tar presenti in quella posizione in modi che la build potrebbe non rilevare.

source: The builds assume sstate objects from :term:`SSTATE_DIR` or from a configured :doc:`sstate mirror </dev-manual/sstate-mirrors-setup>` are safe (with :doc:`signature checks </security-manual/sstate-signing>` if configured).
it_it: Le build presuppongono che gli oggetti sstate provenienti da :term:`SSTATE_DIR` o da un :doc:`sstate mirror </dev-manual/sstate-mirrors-setup>` configurato siano sicuri (con :doc:`signature checks </security-manual/sstate-signing>` se configurati).

source: The builds combine many different software components and we take it on trust that there aren't issues in those code bases. We'd recommend build environments being set up in such a way that if such an issue were ever discovered, which at some point could happen, the build environments themselves could be simply destroyed and rebuilt cleanly, i.e. they're disposable.
it_it: Le build combinano molti componenti software diversi e ci si basa sul presupposto che non vi siano problemi nelle relative codebase. Raccomandiamo di configurare gli ambienti di compilazione in modo tale che, qualora venisse scoperto un problema di questo tipo (cosa che potrebbe accadere in futuro), gli ambienti stessi possano essere semplicemente eliminati e ricostruiti da zero, ovvero siano "usa e getta".

source: The builds generally aim for any input into the build process being verified in some form. For source code tarballs, these would have a checksum. Git source trees would have a specific git revision. Metadata would also usually be under source control and also have revisions.
it_it: In generale, ogni input del processo di build viene verificato in qualche modo. Per i file tarball del codice sorgente, viene generato un checksum. Gli alberi di codice sorgente Git hanno una specifica revisione Git. Anche i metadati sono solitamente gestiti tramite controllo di versione e presentano delle revisioni.

source: The canonical method through which to include a local project is to use the :ref:`ref-classes-externalsrc` class to include that local project. You use either :ref:`structure-build-conf-local.conf` or a recipe's append file to override or set the recipe to point to the local directory from which to fetch the source.
it_it: Il metodo canonico per includere un progetto locale consiste nell'utilizzare la classe :ref:`ref-classes-externalsrc`. È possibile utilizzare il file :ref:`structure-build-conf-local.conf` o il file append di una ricetta per sovrascrivere o impostare la ricetta in modo che punti alla directory locale da cui recuperare il codice sorgente.

source: The capability to run tasks in a fake root environment is known as ":manpage:`fakeroot <fakeroot(1)>`", which is derived from the BitBake keyword/variable flag that requests a fake root environment for a task.
it_it: La capacità di eseguire task in un ambiente root fittizio è nota come ":manpage:`fakeroot <fakeroot(1)>`", che deriva dalla parola chiave/variabile flag di BitBake che richiede un ambiente root fittizio per un task.
